Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: - Provide security parameters to the record layer.
zh_cn: - 为记录层提供安全参数。

source: - RSASSA-PSS signature schemes are defined in Section 4.2.3.
zh_cn: - RSASSA-PSS 签名方案在 4.2.3 节中定义。

source: - References have been updated to point to the updated versions of RFCs, as appropriate (e.g., RFC 5280 rather than RFC 3280).
zh_cn: - 已更新引用以指向适当的 RFC 的更新版本(例如，RFC 5280 而不是 RFC 3280)。

source: - Removed IDEA and DES cipher suites.
zh_cn: - 删除了 IDEA 和 DES 密码套件。

source: - Removing the "early_data" extension (Section 4.2.10) if one was present.
zh_cn: - 删除“early_data”扩展（第 4.2.10 节）（如果存在）。

source: - Request that the client send another ClientHello by responding with a HelloRetryRequest.
zh_cn: - 请求客户端通过响应 HelloRetryRequest 发送另一个 ClientHello。

source: - Return its own "early_data" extension in EncryptedExtensions, indicating that it intends to process the early data.
zh_cn: - 在 EncryptedExtensions 中返回自己的“early_data”扩展，表示它打算处理早期数据。

source: - Server Parameters: Establish other handshake parameters (whether the client is authenticated, application-layer protocol support, etc.).
zh_cn: - 服务器参数：建立其他握手参数(客户端是否经过身份验证，应用层协议支持等)。

source: - Session resumption with and without server-side state as well as the PSK-based cipher suites of earlier TLS versions have been replaced by a single new PSK exchange.
zh_cn: - 使用和不使用服务器端状态的会话恢复以及早期 TLS 版本的基于 PSK 的密码套件已被单个新的 PSK 交换替换。

source: - Some cases where a server does not agree to an extension are error conditions (e.g., the handshake cannot continue), and some are simply refusals to support particular features.
zh_cn: - 服务器不同意扩展的一些情况是错误条件(例如，握手不能继续)，并且一些仅仅是拒绝支持特定功能。

source: - Some cases where a server does not agree to an extension are error conditions, and some are simply refusals to support particular features.
zh_cn: - 某些服务器不同意扩展的情况是错误情况，有些只是拒绝支持特定功能。

source: - Static RSA and Diffie-Hellman cipher suites have been removed; all public-key based key exchange mechanisms now provide forward secrecy.
zh_cn: - 已删除静态 RSA 和 Diffie-Hellman 密码套件；所有基于公钥的密钥交换机制现在都提供了前瞻性保密。

source: - Substantial cleanup to the client's and server's ability to specify which hash and signature algorithms they will accept.
zh_cn: - 大量清理客户端和服务器指定他们将接受哪些哈希和签名算法的能力。

source: - Support for the SSLv2 backward-compatible hello is now a MAY, not a SHOULD, with sending it a SHOULD NOT.
zh_cn: - 支持 SSLv2 向后兼容的 hello 现在是一个 MAY，而不是 SHOULD，发送它是 SHOULD NOT。

source: - TLS 1.2 ClientHellos MAY omit this extension.
zh_cn: - TLS 1.2 ClientHellos 可以省略此扩展。

source: - TLS Extensions definition and AES Cipher Suites were merged in from external [TLSEXT] and [TLSAES].
zh_cn: - TLS 扩展定义和 AES 密码套件从外部 [TLSEXT] 和 [TLSAES] 合并。

source: - TLS_RSA_WITH_AES_128_CBC_SHA is now the mandatory to implement cipher suite.
zh_cn: - 现在，TLS_RSA_WITH_AES_128_CBC_SHA 是强制实现密码套件的。

source: - The "server_name" [RFC6066] and "certificate_authorities" extensions are used to guide certificate selection.
zh_cn: - “server_name”[RFC6066] 和“certificate_authorities”扩展用于指导证书选择。

source: - The "server_name" and "trusted_ca_keys" extensions [TLSEXT] are used to guide certificate selection.
zh_cn: - “server_name”和“trusted_ca_keys”扩展 [TLSEXT] 用于指导证书选择。

source: - The "signature_algorithms_cert" extension allows a client to indicate which signature algorithms it can validate in X.509 certificates.
zh_cn: - “signature_algorithms_cert”扩展允许客户端指示它可以在 X.509 证书中验证哪些签名算法。

source: - The "supported_versions" ClientHello extension can be used to negotiate the version of TLS to use, in preference to the legacy_version field of the ClientHello.
zh_cn: - “supported_versions” ClientHello 扩展可用于协商要使用的 TLS 版本，优先于 ClientHello 的 legacy_version 字段。

source: - The Extended Key Usage extension in a certificate matches the request when all key purpose OIDs present in the request are also found in the Extended Key Usage certificate extension.
zh_cn: - 当在扩展密钥用法证书扩展中也找到请求中存在的所有关键用途 OID 时，证书中的扩展密钥用法扩展与请求匹配。

source: - The Key Usage extension in a certificate matches the request when all key usage bits asserted in the request are also asserted in the Key Usage certificate extension.
zh_cn: - 当在密钥用法证书扩展中也声明请求中声明的所有密钥使用位时，证书中的密钥用法扩展与请求匹配。

source: - The MD5/SHA-1 combination in the digitally-signed element has been replaced with a single hash.
zh_cn: - 数字签名元素中的 MD5/SHA-1 组合已替换为单个散列。

source: - The MD5/SHA-1 combination in the pseudorandom function (PRF) has been replaced with cipher-suite-specified PRFs.
zh_cn: - 伪随机函数(PRF)中的 MD5/SHA-1 组合已被密码套件指定的 PRF 替换。

source: - The TLS 1.2 version negotiation mechanism has been deprecated in favor of a version list in an extension.
zh_cn: - 不推荐使用 TLS 1.2 版本协商机制，而是使用扩展中的版本列表。

source: - The TLS version number
zh_cn: - TLS 版本号

source: - The certificate MUST allow the key to be used for signing (i.e., the digitalSignature bit MUST be set if the Key Usage extension is present) with a signature scheme indicated in the client's "signature_algorithms"/"signature_algorithms_cert" extensions (see Section 4.2.3).
zh_cn: - 证书必须允许密钥用于签名方案中的签名（即，如果存在密钥用法扩展，则必须设置 digitalSignature 位），签名方案在客户端的“signature_algorithms”/“signature_algorithms_cert”扩展中指示（参见第 4.2.3 节）。

source: - The certificate and signing key to be used.
zh_cn: - 要使用的证书和签名密钥。

source: - The certificate type MUST be X.509v3 [RFC5280], unless explicitly negotiated otherwise (e.g., [RFC7250]).
zh_cn: - 证书类型必须是 X.509v3 [RFC5280]，除非另有明确协商(例如，[RFC7250])。

source: - The certificate type MUST be X.509v3, unless explicitly negotiated otherwise (e.g., [TLSPGP]).
zh_cn: - 证书类型必须是 X.509v3，除非另有明确协商(例如，[TLSPGP])。

source: - The certificates MUST be signed using an acceptable hash/signature algorithm pair, as described in Section 7.4.4.
zh_cn: - 证书必须使用可接受的散列/签名算法对进行签名，如第 7.4.4 节所述。

source: - The certificates MUST be signed using an acceptable signature algorithm, as described in Section 4.3.2.
zh_cn: - 证书必须使用可接受的签名算法进行签名，如第 4.3.2 节所述。

source: - The connection is private.
zh_cn: - 连接是私密的。

source: - The connection is reliable.
zh_cn: - 连接是可靠的。

source: - The content covered by the digital signature
zh_cn: - 数字签名所涵盖的内容

source: - The content to be signed
zh_cn: - 要签名的内容

source: - The context string
zh_cn: - 上下文字符串

source: - The digital signature received in the signature field of the CertificateVerify message
zh_cn: - 在 CertificateVerify 消息的签名字段中收到的数字签名

source: - The end entity certificate's public key (and associated restrictions) MUST be compatible with the selected key exchange algorithm.
zh_cn: - 最终实体证书的公钥(和相关限制)必须与所选密钥交换算法兼容。

source: - The end-entity certificate provided by the client MUST contain a key that is compatible with certificate_types.
zh_cn: - 客户端提供的终端实体证书必须包含与 certificate_types 兼容的密钥。

source: - The end-entity certificate's public key (and associated restrictions) has to be compatible with the certificate types listed in CertificateRequest:
zh_cn: - 终端实体证书公钥(和相关限制)必须与 CertificateRequest 中列出的证书类型兼容：

source: - The handshake state machine has been significantly restructured to be more consistent and to remove superfluous messages such as ChangeCipherSpec (except when needed for middlebox compatibility).
zh_cn: - 握手状态机已经过重大调整，以更加一致，并删除多余的消息，如 ChangeCipherSpec(除了中间盒兼容性需要时)。

source: - The key derivation functions have been redesigned.
zh_cn: - 密钥派生函数已经过重新设计。

source: - The length of the key being generated
zh_cn: - 生成密钥的长度

source: - The list of supported symmetric encryption algorithms has been pruned of all algorithms that are considered legacy.
zh_cn: - 支持的对称加密算法列表，已经删除了所有被视为遗留算法的算法。

source: - The negotiation is reliable: no attacker can modify the negotiation communication without being detected by the parties to the communication.
zh_cn: - 协商是可靠的：没有攻击者可以在不被通信方检测到的情况下修改协商通信。

source: - The negotiation of a shared secret is secure: the negotiated secret is unavailable to eavesdroppers, and for any authenticated connection the secret cannot be obtained, even by an attacker who can place himself in the middle of the connection.
zh_cn: - 共享机密的协商是安全的：窃听者无法获得协商的机密，并且对于任何经过身份验证的连接，即使是可以将自己置于连接中间的攻击者也无法获得机密。

source: - The peer's identity can be authenticated using asymmetric, or public key, cryptography (e.g., RSA [RSA], DSA [DSS], etc.).
zh_cn: - 可以使用非对称或公钥加密(例如，RSA [RSA]，DSA [DSS] 等)来认证对等端的身份。

source: - The private signing key corresponding to the certificate sent in the previous message
zh_cn: - 与上一条消息中发送的证书对应的私有签名密钥

source: - The public key contained in the end-entity certificate found in the associated Certificate message
zh_cn: - 在关联的 Certificate 消息中找到的最终实体证书中包含的公钥

source: - The selected ALPN [RFC7301] protocol, if any
zh_cn: - 所选的 ALPN [RFC7301] 协议(如果有)

source: - The selected cipher suite
zh_cn: - 选定的密码套件

source: - The server's end-entity certificate's public key (and associated restrictions) MUST be compatible with the selected authentication algorithm from the client's "signature_algorithms" extension (currently RSA, ECDSA, or EdDSA).
zh_cn: - 服务器的终端实体证书的公钥(和相关限制)必须与客户端的“signature_algorithms”扩展(目前为 RSA，ECDSA 或 EdDSA)中的所选验证算法兼容。

source: - The usual clarifications and editorial work.
zh_cn: - 通常的澄清和编辑工作。

source: - Tightened up a number of requirements.
zh_cn: - 收紧了许多要求。

source: - Tighter checking of EncryptedPreMasterSecret version numbers.
zh_cn: - 更严格地检查 EncryptedPreMasterSecret 版本号。

source: - Updating the "pre_shared_key" extension if present by recomputing the "obfuscated_ticket_age" and binder values and (optionally) removing any PSKs which are incompatible with the server's indicated cipher suite.
zh_cn: - 更新“pre_shared_key”扩展（如果存在），通过重新计算“obfuscated_ticket_age”和绑定器值以及（可选地）删除与服务器指示的密码套件不兼容的任何 PSK。

source: - Verify_data length now depends on the cipher suite (default is still 12).
zh_cn: - Verify_data 长度现在取决于密码套件(默认值仍为 12)。

source: - When (EC)DHE is in use, the server will also provide a "key_share" extension.
zh_cn: - 当 (EC)DHE 正在使用时，服务器还将提供“key_share”扩展。

source: - When authenticating via a certificate, the server will send the Certificate (Section 4.4.2) and CertificateVerify (Section 4.4.3) messages.
zh_cn: - 通过证书进行身份验证时，服务器将发送 Certificate(第 4.4.2 节)和 CertificateVerify(第 4.4.3 节)消息。

source: - 1xx: Informational - Request received, continuing process
zh_cn: - 1xx：信息 - 收到请求，继续处理

source: - 2xx: Success - The action was successfully received, understood, and accepted
zh_cn: - 2xx：成功 - 操作已成功收到，理解并被接受

source: - 3xx: Redirection - Further action must be taken in order to complete the request
zh_cn: - 3xx：重定向 - 必须采取进一步措施才能完成请求

source: - 4xx: Client Error - The request contains bad syntax or cannot be fulfilled
zh_cn: - 4xx：客户端错误 - 请求包含错误的语法或无法满足

source: - 5xx: Server Error - The server failed to fulfill an apparently valid request
zh_cn: - 5xx：服务器错误 - 服务器无法满足明显有效的请求

source: - A client MUST NOT send an Expect request-header field (section 14.20) with the "100-continue" expectation if it does not intend to send a request body.
zh_cn: - 如果客户端不打算发送请求正文，则不得发送具有“100-continue”期望的 Expect 请求首部字段(第 14.20 节)。

source: - A port that is empty or not given is equivalent to the default port for that URI-reference;
zh_cn: - 空的或未给出的端口等同于该 URI 引用的默认端口；

source: - A proxy MUST NOT forward a 100 (Continue) response if the request message was received from an HTTP/1.0 (or earlier) client and did not include an Expect request-header field with the "100-continue" expectation.
zh_cn: - 如果从 HTTP/1.0(或更早版本)客户端收到请求消息，并且未包含具有“100-continue”期望的 Expect 请求首部字段，则代理不得转发 100(继续)响应。

source: - An empty abs_path is equivalent to an abs_path of "/".
zh_cn: - 空的 abs_path 相当于 “/” 的 abs_path。

source: - An origin server MAY omit a 100 (Continue) response if it has already received some or all of the request body for the corresponding request.
zh_cn: - 如果原始服务器已经收到相应请求的部分或全部请求主体，则可以省略 100(继续)响应。

source: - An origin server SHOULD NOT send a 100 (Continue) response if the request message does not include an Expect request-header field with the "100-continue" expectation, and MUST NOT send a 100 (Continue) response if such a request comes from an HTTP/1.0 (or earlier) client.
zh_cn: - 如果请求消息不包含具有“100-continue”期望的 Expect 请求首部字段，则原始服务器不应发送 100(继续)响应，如果此请求来自 HTTP/1.0(或更早版本)的客户端，则不得发送 100(继续)响应。

source: - An origin server that sends a 100 (Continue) response MUST ultimately send a final status code, once the request body is received and processed, unless it terminates the transport connection prematurely.
zh_cn: - 发送 100(继续)响应的源服务器必须在收到并处理请求主体后最终发送最终状态代码，除非它过早终止传输连接。

source: - Annotation of existing resources;
zh_cn: - 现有资源的注释；

source: - By opening and closing fewer TCP connections, CPU time is saved in routers and hosts (clients, servers, proxies, gateways, tunnels, or caches), and memory used for TCP protocol control blocks can be saved in hosts.
zh_cn: - 通过打开和关闭较少的 TCP 连接，CPU 时间减少在路由器和主机(客户端，服务器，代理，网关，隧道或缓存)中，用于 TCP 协议控制块的内存可以减少在主机中。

source: - Comparisons of host names MUST be case-insensitive;
zh_cn: - 主机名的比较必须不区分大小写；

source: - Comparisons of scheme names MUST be case-insensitive;
zh_cn: - 方案名称的比较必须不区分大小写；

source: - Dealing with 10k+ of elements that are generated in some fashion somewhere and thus the chain can tell the source to limit the amount it generates.
zh_cn: - 处理以某种方式在某处生成的 10k+ 元素，因此链可以告诉源限制它产生的量。

source: - Extending a database through an append operation.
zh_cn: - 通过追加操作扩展数据库。

source: - HTTP can evolve more gracefully, since errors can be reported without the penalty of closing the TCP connection.
zh_cn: - HTTP 可以更优雅地发展，因为可以报告错误而不必关闭 TCP 连接。

source: - HTTP requests and responses can be pipelined on a connection.
zh_cn: - HTTP 请求和响应可以在连接上流水线化。

source: - If a client will wait for a 100 (Continue) response before sending the request body, it MUST send an Expect request-header field (section 14.20) with the "100-continue" expectation.
zh_cn: - 如果客户端在发送请求主体之前将等待 100(继续)响应，它必须发送具有“100-continue”期望的 Expect 请求报首部字段(第 14.20 节)。

source: - If a proxy receives a request that includes an Expect request- header field with the "100-continue" expectation, and the proxy either knows that the next-hop server complies with HTTP/1.1 or higher, or does not know the HTTP version of the next-hop server, it MUST forward the request, including the Expect header field.
zh_cn: - 如果代理收到包含具有“100-continue”期望的 Expect 请求首部字段的请求，并且代理知道下一跳服务器符合 HTTP/1.1 或更高版本，或者不知道在下一跳服务器上的 HTTP 版本，它必须转发请求，包括 Expect 首部字段。

source: - If an origin server receives a request that does not include an Expect request-header field with the "100-continue" expectation, the request includes a request body, and the server responds with a final status code before reading the entire request body from the transport connection, then the server SHOULD NOT close the transport connection until it has read the entire request, or until the client closes the connection.
zh_cn: - 如果源服务器收到的请求不包含具有“100-continue”期望的 Expect 请求首部字段，该请求包括请求主体，并且服务器在读取整个请求主体之前使用最终状态代码进行响应传输连接，然后服务器不应关闭传输连接，直到它已读取整个请求，或直到客户端关闭连接。

source: - If the proxy knows that the version of the next-hop server is HTTP/1.0 or lower, it MUST NOT forward the request, and it MUST respond with a 417 (Expectation Failed) status.
zh_cn: - 如果代理知道下一跳服务器的版本是 HTTP/1.0 或更低，它不复转发请求，它必须以 417(期望失败)状态响应。

source: - Java 8 lambda-friendly API
zh_cn: - Java 8 lambda 友好的 API

source: - Latency on subsequent requests is reduced since there is no time spent in TCP's connection opening handshake.
zh_cn: - 由于没有花费在 TCP 连接打开时握手上的时间，因此减少了后续请求的延迟。

source: - Many blocking and/or pull-based data sources which may eventually get a non-blocking reactive API/driver in the future.
zh_cn: - 许多阻塞和/或基于拉的数据源，最终可能会在未来获得非阻塞的响应 API/驱动程序。

source: - Network (Streaming) IO where either the network helps or the protocol used supports requesting some logical amount.
zh_cn: - 网络(流)IO，其中网络帮助或使用的协议支持请求一些逻辑量。

source: - Network congestion is reduced by reducing the number of packets caused by TCP opens, and by allowing TCP sufficient time to determine the congestion state of the network.
zh_cn: - 通过减少 TCP 打开引起的数据包数量，并允许 TCP 有足够的时间来确定网络的拥塞状态，从而减少网络拥塞。

source: - Posting a message to a bulletin board, newsgroup, mailing list, or similar group of articles;
zh_cn: - 在公告板，新闻组，邮件列表或类似的文章组中发布消息；

source: - Providing a block of data, such as the result of submitting a form, to a data-handling process;
zh_cn: - 向数据处理过程提供一组数据，例如提交表单的结果；

source: - Proxies SHOULD maintain a cache recording the HTTP version numbers received from recently-referenced next-hop servers.
zh_cn: - 代理应该保持一个缓存，记录从最近引用的下一跳服务器收到的 HTTP 版本号。

source: - Reading (parsing) files from disk is inherently blocking and pull-based which works well with backpressure as you control, for example, how many lines you read from this for a specified request amount).
zh_cn: - 从磁盘读取（解析）文件本质上是阻塞和基于拉取的，当您控制时，它可以很好地处理背压，例如，您为指定的请求数量控制读取多少行。

source: - Reading from a database through JDBC is also blocking and pull-based and is controlled by you by calling `ResultSet.next()` for likely each downstream request.
zh_cn: - 通过 JDBC 从数据库读取也是阻塞和基于拉取的，并且可以通过调用 `ResultSet.next()` 来控制每个下游请求。

source: - SHOULD NOT continue and
zh_cn: - 不应该继续并且

source: - SHOULD close the connection if it has not completed sending the request message.
zh_cn: - 应该关闭连接如果连接尚未完成发送请求消息。

source: - Upon receiving a request which includes an Expect request-header field with the "100-continue" expectation, an origin server MUST either respond with 100 (Continue) status and continue to read from the input stream, or respond with a final status code.
zh_cn: - 收到包含具有“100-continue”期望的 Expect 请求首部字段的请求后，源服务器必须以 100(继续)状态响应并继续从输入流中读取，或以最终状态代码进行响应。

source: - You deal with GUI events such as mouse moves or touch events: these can rarely be backpressured reasonably and aren't that frequent.
zh_cn: - 您处理 GUI 事件，例如鼠标移动或触摸事件：这些事件很少能够合理地背压并且不那么频繁。

source: - You have a flow of no more than 1000 elements at its longest: i.e., you have so few elements over time that there is practically no chance for OOME in your application.
zh_cn: - 最长流不超过 1000 个元素：即，随着时间的推移元素会很少，因此在您的应用程序中几乎不会出现 OOME。

source: - Your flow is essentially synchronous but your platform doesn't support Java Streams or you miss features from it.
zh_cn: - 您的流基本上是同步的，但您的平台不支持 Java Streams，或者您错过了它的功能。

source: - [Base reactive interfaces](#base-reactive-interfaces)
zh_cn: - [基本响应接口](#base-reactive-interfaces)

source: - [Maven address and base package](#maven-address-and-base-package)
zh_cn: - [Maven 地址和基础包](#maven-address-and-base-package)

source: - [Miscellaneous changes](#miscellaneous-changes)
zh_cn: - [杂项更改](#miscellaneous-changes)

source: - [Observable and Flowable](#observable-and-flowable)
zh_cn: - [Observable 和 Flowable](#observable-and-flowable)

source: - [Other classes](#other-classes)
zh_cn: - [其他类](#other-classes)

source: - [Subjects and Processors](#subjects-and-processors)
zh_cn: - [Subjects 和 Processors](#subjects-and-processors)

source: - [`io.reactivex.Completable`](http://reactivex.io/RxJava/2.x/javadoc/io/reactivex/Completable.html): a flow without items but only a completion or error signal,
zh_cn: - [`io.reactivex.Completable`](http://reactivex.io/RxJava/2.x/javadoc/io/reactivex/Completable.html): 没有项目但只有完成或错误信号的流，

source: - [`io.reactivex.Flowable`](http://reactivex.io/RxJava/2.x/javadoc/io/reactivex/Flowable.html): 0..N flows, supporting Reactive-Streams and backpressure
zh_cn: - [`io.reactivex.Flowable`](http://reactivex.io/RxJava/2.x/javadoc/io/reactivex/Flowable.html): 0..N 流，支持响应式流和背压

source: - [`io.reactivex.Maybe`](http://reactivex.io/RxJava/2.x/javadoc/io/reactivex/Maybe.html): a flow with no items, exactly one item or an error.
zh_cn: - [`io.reactivex.Maybe`](http://reactivex.io/RxJava/2.x/javadoc/io/reactivex/Maybe.html): 没有项目，只有一个项目或错误的流。

source: - [`io.reactivex.Observable`](http://reactivex.io/RxJava/2.x/javadoc/io/reactivex/Observable.html): 0..N flows, no backpressure,
zh_cn: - [`io.reactivex.Observable`](http://reactivex.io/RxJava/2.x/javadoc/io/reactivex/Observable.html): 0..N 流，无背压，

source: - [`io.reactivex.Single`](http://reactivex.io/RxJava/2.x/javadoc/io/reactivex/Single.html): a flow of exactly 1 item or an error,
zh_cn: - [`io.reactivex.Single`](http://reactivex.io/RxJava/2.x/javadoc/io/reactivex/Single.html): 仅 1 个项目或错误的流，

source: - `CompositeSubscription` to `CompositeDisposable`
zh_cn: - `CompositeSubscription` 变为 `CompositeDisposable`

source: - `ON_OVERFLOW_DEFAULT`: currently it is the same as `ON_OVERFLOW_ERROR`
zh_cn: - `ON_OVERFLOW_DEFAULT`：目前它与 `ON_OVERFLOW_ERROR` 相同

source: - `ON_OVERFLOW_DROP_LATEST` : if an overflow would happen, the current value will be simply ignored and only the old values will be delivered once the downstream requests.
zh_cn: - `ON_OVERFLOW_DROP_LATEST`：如果发生溢出，将简单地忽略当前值，并且只有下游请求才会传递旧值。

source: - `ON_OVERFLOW_DROP_OLDEST` : drops the oldest element in the buffer and adds the current value to it.
zh_cn: - `ON_OVERFLOW_DROP_OLDEST`：删除缓冲区中最旧的元素并将当前值添加到缓冲区中。

source: - `ON_OVERFLOW_ERROR`: this is the default behavior of the previous two overloads, signalling a `BufferOverflowException`
zh_cn: - `ON_OVERFLOW_ERROR`：这是前两个重载的默认行为，表示 `BufferOverflowException`

source: - `OnErrorNotImplementedException`: reintroduced to detect when the user forgot to add error handling to `subscribe()`.
zh_cn: - `OnErrorNotImplementedException`：重新引入以检测用户何时忘记向 `subscribe()` 添加错误处理。

source: - `ProtocolViolationException`: indicates a bug in an operator
zh_cn: - `ProtocolViolationException`：表示运算符中的错误

source: - `RefCountSubscription` has been removed.
zh_cn: - `RefCountSubscription` 已被移除。

source: - `Schedulers.computation()`: Run computation intensive work on a fixed number of dedicated threads in the background.
zh_cn: - `Schedulers.computation()`: 在后台固定数量的专用线程上，运行计算密集型工作。

source: - `Schedulers.io()`: Run I/O-like or blocking operations on a dynamically changing set of threads.
zh_cn: - `Schedulers.io()`: 在动态变化的线程集上运行类似 I/O 或阻塞操作。

source: - `Schedulers.single()`: Run work on a single thread in a sequential and FIFO manner.
zh_cn: - `Schedulers.single()`: 以顺序和 FIFO 方式在单个线程上运行。

source: - `Schedulers.trampoline()`: Run work in a sequential and FIFO manner in one of the participating threads, usually for testing purposes.
zh_cn: - `Schedulers.trampoline()`: 在一个参与线程中以顺序和 FIFO 方式运行，通常用于测试目的。

source: - `SerialSubscription` and `MultipleAssignmentSubscription` have been merged into `SerialDisposable`.
zh_cn: - `SerialSubscription` 和 `MultipleAssignmentSubscription` 已合并到 `SerialDisposable` 中。

source: - `UndeliverableException`: wraps the original exception that can't be delivered due to lifecycle restrictions on a `Subscriber`/`Observer`.
zh_cn: - `UndeliverableException`：包装因 `Subscriber`/`Observer` 的生命周期限制而无法传递的原始异常。

source: - `assertFailure(Class<? extends Throwable> clazz, T... items)`: asserts if subscribed, received exactly the given items in the given order followed by a `Throwable` error of wich `clazz.isInstance()` returns true.
zh_cn: - `assertFailure(Class<? extends Throwable> clazz, T... items)`：断言如果订阅，按给定顺序接收到给定项后，跟一个 `Throwable` 错误，其 `clazz.isInstance()` 返回 true。

source: - `assertFailureAndMessage(Class<? extends Throwable> clazz, String message, T... items)`: same as `assertFailure` plus validates the `getMessage()` contains the specified message
zh_cn: - `assertFailureAndMessage(Class<? extends Throwable> clazz, String message, T... items)`：与 `assertFailure` 相同，加上验证 `getMessage()` 包含指定的消息

source: - `assertOf(Consumer<TestSubscriber<T>> consumer)` compose some assertions into the fluent chain (used internally for fusion test as operator fusion is not part of the public API right now).
zh_cn: - `assertOf(Consumer<TestSubscriber<T>> consumer)` 将一些断言组合到流畅的链中(内部用于融合测试，因为运算符融合现在不是公共 API 的一部分)。

source: - `assertResult(T... items)`: asserts if subscribed, received exactly the given items in the given order followed by `onComplete` and no errors
zh_cn: - `assertResult(T... items)`：断言如果已订阅，则在 `onComplete` 之后按给定顺序接收给定的项，并且没有错误

source: - `awaitDone(long time, TimeUnit unit)` awaits a terminal event (blockingly) and cancels the sequence if the timeout elapsed.
zh_cn: - `awaitDone(long time, TimeUnit unit)` 等待终端事件(阻塞)并在超时结束时取消序列。
